docs/pytut-peer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-20 Thu 12:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ZIO Tutorial: Peering</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">ZIO Tutorial: Peering</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org33cd045">1. Create peers</a></li>
<li><a href="#org30128ae">2. Get peer info</a></li>
<li><a href="#orge26dbbd">3. Synchronizing</a></li>
<li><a href="#org814010e">4. Finding peer info</a></li>
<li><a href="#org9ae4d34">5. Stopping a peer</a></li>
</ul>
</div>
</div>
<div class="nav">
<ul class="org-ul">
<li><a href="index.html">Main Page</a></li>
<li><a href="install.html">Installation</a></li>
<li><a href="tutorial.html">Tutorials</a></li>
<li><a href="whytos.html">Design documents</a></li>
<li><a href="api.html">API Reference</a></li>
</ul>

</div>

<p>
ZIO provides <code>zio.Peer</code> which is a service to help an application "know"
what other like-minded applications exist on the network.  See <a href="peer.html">peer</a>
write-up for more information.  Normally application code will use a
peer via a <code>zio.Node</code> (see <a href="node.html">node</a> and <a href="pytut-node.html">node tutorial</a>) but it may also be
used stand-alone and this tutorial will show how.
</p>

<div id="outline-container-org33cd045" class="outline-2">
<h2 id="org33cd045"><span class="section-number-2">1</span> Create peers</h2>
<div class="outline-text-2" id="text-1">
<p>
Peers have a "nickname" and an optional set of headers.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">p1</span> =  zio.Peer(<span style="font-style: italic;">"peer1"</span>, greeting = <span style="font-style: italic;">'Hello world'</span>, color = <span style="font-style: italic;">'green'</span>)
<span style="font-weight: bold; font-style: italic;">p2</span> =  zio.Peer(<span style="font-style: italic;">"peer2"</span>, greeting = <span style="font-style: italic;">'Hajimemashita'</span>, color = <span style="font-style: italic;">'blue'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org30128ae" class="outline-2">
<h2 id="org30128ae"><span class="section-number-2">2</span> Get peer info</h2>
<div class="outline-text-2" id="text-2">
<p>
The Zyre actor runs in a background thread while the <code>zio.Peer</code>
interface is synchronous with the application that uses it.  This
means that the peer will not "know" anything unless given a chance to
"catch up" with what Zyre has been up to.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">print</span> (p1.peers)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">{}</span>
p1.drain()
<span style="font-weight: bold;">print</span> (p1.peers)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">{UUID('e5101ad1-e796-42f3-8d88-381cde0060f8'):</span>
<span style="font-weight: bold; font-style: italic;">#   </span><span style="font-weight: bold; font-style: italic;">PeerInfo(uuid=UUID('e5101ad1-e796-42f3-8d88-381cde0060f8'), </span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">nick='peer2', </span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">headers={'greeting': 'Hajimemashita', 'color': 'blue'})}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge26dbbd" class="outline-2">
<h2 id="orge26dbbd"><span class="section-number-2">3</span> Synchronizing</h2>
<div class="outline-text-2" id="text-3">
<p>
One use of peering is for separate asynchronous tasks to synchronize.
For example, one peer may want to wait for another peer to become
available before the first continues.  
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">found</span> = p2.waitfor(<span style="font-style: italic;">'peer1'</span>)                            
<span style="font-weight: bold;">print</span>(found)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[UUID('9a3fbd0e-54fc-4015-ae01-ebe9b15bab3a')]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org814010e" class="outline-2">
<h2 id="org814010e"><span class="section-number-2">4</span> Finding peer info</h2>
<div class="outline-text-2" id="text-4">
<p>
A peer may also query the network for other peers by a nickname.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">found</span> = p2.matchnick(<span style="font-style: italic;">'peer2'</span>)
<span style="font-weight: bold;">print</span> (found)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[UUID('e5101ad1-e796-42f3-8d88-381cde0060f8')]</span>
<span style="font-weight: bold; font-style: italic;">found</span> = p1.matchnick(<span style="font-style: italic;">'does not exist'</span>) 
<span style="font-weight: bold;">print</span> (found)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ae4d34" class="outline-2">
<h2 id="org9ae4d34"><span class="section-number-2">5</span> Stopping a peer</h2>
<div class="outline-text-2" id="text-5">
<p>
To make a peer disappear use its <code>stop()</code> method or delete it.
</p>

<pre class="example">
p1.stop()
del(p2)
</pre>

<p>
Note, a peer <b>must</b> be explicitly stopped or destroyed by the
application or else the application may hang on exit.
</p>
</div>
</div>
</div>
</body>
</html>
